{
  "value.ebe.true": "On",
  "value.ebe.false": "Off",
  "value.ebe.allowed": "Allowed",
  "value.ebe.forced": "Forced",
  "value.ebe.disabled": "Disabled",
  "value.ebe.smart": "Smart",
  "value.ebe.all": "All",
  "value.ebe.most": "Most",
  "value.ebe.some": "Some",
  "value.ebe.few": "Few",

  "ebe.config.render_enhanced_chests": "Enhanced Chests",
  "ebe.config.render_enhanced_chests.comment": "Enables baked chest models, greatly improving performance in areas with lots of chests. Also allows for seeing chests from far distances. Disable if chests appear invisible due to another mod.",
  "ebe.config.render_enhanced_signs": "Enhanced Signs",
  "ebe.config.render_enhanced_signs.comment": "Enables baked sign models and smart sign text rendering, greatly improving performance in areas with lots of signs. Also allows for seeing signs from far distances. Disable if signs appear invisible due to another mod.",
  "ebe.config.render_enhanced_bells": "Enhanced Bells",
  "ebe.config.render_enhanced_bells.comment": "Enables fully baked bell models, greatly improving performance in areas with lots of bells. Also allows for seeing bells from far distances. Disable if bells appear invisible due to another mod.",
  "ebe.config.render_enhanced_beds": "Enhanced Beds",
  "ebe.config.render_enhanced_beds.comment": "Enables baked bed models, greatly improving performance in areas with lots of beds. Also allows for seeing beds from far distances. Disable if beds appear invisible due to another mod.",
  "ebe.config.render_enhanced_shulker_boxes": "Enhanced Shulker Boxes",
  "ebe.config.render_enhanced_shulker_boxes.comment": "Enables baked shulker box models, greatly improving performance in areas with lots of shulker boxes. Also allows for seeing shulker boxes from far distances. Disable if shulker boxes appear invisible due to another mod.",
  "ebe.config.render_enhanced_decorated_pots": "Enhanced Decorated Pots",
  "ebe.config.render_enhanced_decorated_pots.comment": "Enables baked decorated pot models, greatly improving performance in areas with lots of decorated pots. Also allows for seeing decorated pots from far distances. Disable if decorated pots appear invisible, or if modded pottery patterns are not working properly.",
  "ebe.config.chest_ao": "Smooth Chest Lighting",
  "ebe.config.chest_ao.comment": "Allows for chests to use smooth lighting and ambient occlusion. Requires Enhanced Chests to be enabled.",
  "ebe.config.sign_ao": "Smooth Sign Lighting",
  "ebe.config.sign_ao.comment": "Allows for signs to use smooth lighting and ambient occlusion. Requires Enhanced Signs to be enabled.",
  "ebe.config.bell_ao": "Smooth Bell Lighting",
  "ebe.config.bell_ao.comment": "Allows for bells to use smooth lighting and ambient occlusion. Requires Enhanced Bells to be enabled.",
  "ebe.config.bed_ao": "Smooth Bed Lighting",
  "ebe.config.bed_ao.comment": "Allows for beds to use smooth lighting and ambient occlusion. Requires Enhanced Beds to be enabled.",
  "ebe.config.shulker_box_ao": "Smooth Shulker Box Lighting",
  "ebe.config.shulker_box_ao.comment": "Allows for shulker boxes to use smooth lighting and ambient occlusion. Requires Enhanced Shulker Boxes to be enabled.",
  "ebe.config.decorated_pot_ao": "Smooth Decorated Pot Lighting",
  "ebe.config.decorated_pot_ao.comment": "Allows for decorated pots to use smooth lighting and ambient occlusion. Requires Enhanced Decorated Pots to be enabled.",
  "ebe.config.christmas_chests": "Christmas Chests",
  "ebe.config.christmas_chests.valueComment.allowed": "Allowed - Christmas texture will be applied from December 24th to 26th.",
  "ebe.config.christmas_chests.valueComment.forced": "Forced - Christmas texture will always be applied.",
  "ebe.config.christmas_chests.valueComment.disabled": "Disabled - Christmas texture will never be applied.",
  "ebe.config.christmas_chests.comment": "Either allows, forces, or disables the Christmas chest texture. Requires Enhanced Chests to be enabled.",
  "ebe.config.sign_text_rendering": "Sign Text Rendering",
  "ebe.config.sign_text_rendering.valueComment.smart": "Smart - The maximum render distance will be automatically determined based on how many signs are rendering at once.",
  "ebe.config.sign_text_rendering.valueComment.all": "All - All signs within block entity render distance will try to render text. Very performance heavy.",
  "ebe.config.sign_text_rendering.valueComment.most": "Most - All signs within 50%% of block entity render distance will try to render text.",
  "ebe.config.sign_text_rendering.valueComment.some": "Some - All signs within 30%% of block entity render distance will try to render text. ",
  "ebe.config.sign_text_rendering.valueComment.few": "Few - All signs within 20%% of block entity render distance will try to render text. Highest performance.",
  "ebe.config.sign_text_rendering.comment": "Determines the maximum distance from the player that sign text will render. Requires Enhanced Signs to be enabled.",
  "ebe.config.experimental_chests": "Experimental Chests",
  "ebe.config.experimental_chests.comment": "Enables very experimental rendering features for chests, such as specially generated particle textures which work with resource packs.",
  "ebe.config.experimental_beds": "Experimental Beds",
  "ebe.config.experimental_beds.comment": "Enables very experimental rendering features for beds, such as specially generated particle textures which work with resource packs.",
  "ebe.config.experimental_signs": "Experimental Signs",
  "ebe.config.experimental_signs.comment": "Enables very experimental rendering features for signs, such as specially generated particle textures which work with resource packs.",
  "ebe.config.force_resource_pack_compat": "Force Resource Pack Compatibility",
  "ebe.config.force_resource_pack_compat.comment": "Enable this if blocks are invisible when using resource packs. Do not use with resource packs designed for this mod. If issues continue, report them.",
  "ebe.config.dump": "Dump Example Resources",
  "ebe.config.dump.comment": "Dumps the mod's default resources to .minecraft/enhanced_bes_dump/ to be used as an example by resource pack makers."
}